zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Kinetis/KE/periph3/PERI_MSCAN.h
#define MSCAN_CANCTL0_INITRQ_MASK                (0x1U)
#define MSCAN_CANCTL0_INITRQ_SHIFT               (0U)
/*! INITRQ - Initialization Mode Request
 *  0b0..Normal operation.
 *  0b1..MSCAN in initialization mode.
 */
#define MSCAN_CANCTL0_INITRQ(x)                  (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL0_INITRQ_SHIFT)) & MSCAN_CANCTL0_INITRQ_MASK)

#define MSCAN_CANCTL0_SLPRQ_MASK                 (0x2U)
#define MSCAN_CANCTL0_SLPRQ_SHIFT                (1U)
/*! SLPRQ - Sleep Mode Request
 *  0b0..Running - The MSCAN functions normally.
 *  0b1..Sleep mode request - The MSCAN enters sleep mode when CAN bus idle.
 */
#define MSCAN_CANCTL0_SLPRQ(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL0_SLPRQ_SHIFT)) & MSCAN_CANCTL0_SLPRQ_MASK)

#define MSCAN_CANCTL0_WUPE_MASK                  (0x4U)
#define MSCAN_CANCTL0_WUPE_SHIFT                 (2U)
/*! WUPE - WakeUp Enable
 *  0b0..Wakeup disabled - The MSCAN ignores traffic on CAN.
 *  0b1..Wakeup enabled - The MSCAN is able to restart.
 */
#define MSCAN_CANCTL0_WUPE(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL0_WUPE_SHIFT)) & MSCAN_CANCTL0_WUPE_MASK)

#define MSCAN_CANCTL0_TIME_MASK                  (0x8U)
#define MSCAN_CANCTL0_TIME_SHIFT                 (3U)
/*! TIME - Timer Enable
 *  0b0..Disable internal MSCAN timer.
 *  0b1..Enable internal MSCAN timer.
 */
#define MSCAN_CANCTL0_TIME(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL0_TIME_SHIFT)) & MSCAN_CANCTL0_TIME_MASK)

#define MSCAN_CANCTL0_SYNCH_MASK                 (0x10U)
#define MSCAN_CANCTL0_SYNCH_SHIFT                (4U)
/*! SYNCH - Synchronized Status
 *  0b0..MSCAN is not synchronized to the CAN bus.
 *  0b1..MSCAN is synchronized to the CAN bus.
 */
#define MSCAN_CANCTL0_SYNCH(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL0_SYNCH_SHIFT)) & MSCAN_CANCTL0_SYNCH_MASK)

#define MSCAN_CANCTL0_CSWAI_MASK                 (0x20U)
#define MSCAN_CANCTL0_CSWAI_SHIFT                (5U)
/*! CSWAI - CAN Stops in Wait Mode
 *  0b0..The module is not affected during wait mode.
 *  0b1..The module ceases to be clocked during wait mode.
 */
#define MSCAN_CANCTL0_CSWAI(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL0_CSWAI_SHIFT)) & MSCAN_CANCTL0_CSWAI_MASK)

#define MSCAN_CANCTL0_RXACT_MASK                 (0x40U)
#define MSCAN_CANCTL0_RXACT_SHIFT                (6U)
/*! RXACT - Receiver Active Status
 *  0b0..MSCAN is transmitting or idle.
 *  0b1..MSCAN is receiving a message, including when arbitration is lost.
 */
#define MSCAN_CANCTL0_RXACT(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL0_RXACT_SHIFT)) & MSCAN_CANCTL0_RXACT_MASK)

#define MSCAN_CANCTL0_RXFRM_MASK                 (0x80U)
#define MSCAN_CANCTL0_RXFRM_SHIFT                (7U)
/*! RXFRM - Received Frame Flag
 *  0b0..No valid message was received since last clearing this flag.
 *  0b1..A valid message was received since last clearing of this flag.
 */
#define MSCAN_CANCTL0_RXFRM(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL0_RXFRM_SHIFT)) & MSCAN_CANCTL0_RXFRM_MASK)
/*! @} */

/*! @name CANCTL1 - MSCAN Control Register 1 */
/*! @{ */

#define MSCAN_CANCTL1_INITAK_MASK                (0x1U)
#define MSCAN_CANCTL1_INITAK_SHIFT               (0U)
/*! INITAK - Initialization Mode Acknowledge
 *  0b0..Running - The MSCAN operates normally.
 *  0b1..Initialization mode active - The MSCAN has entered initialization mode.
 */
#define MSCAN_CANCTL1_INITAK(x)                  (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL1_INITAK_SHIFT)) & MSCAN_CANCTL1_INITAK_MASK)

#define MSCAN_CANCTL1_SLPAK_MASK                 (0x2U)
#define MSCAN_CANCTL1_SLPAK_SHIFT                (1U)
/*! SLPAK - Sleep Mode Acknowledge
 *  0b0..Running - The MSCAN operates normally.
 *  0b1..Sleep mode active - The MSCAN has entered sleep mode.
 */
#define MSCAN_CANCTL1_SLPAK(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL1_SLPAK_SHIFT)) & MSCAN_CANCTL1_SLPAK_MASK)

#define MSCAN_CANCTL1_WUPM_MASK                  (0x4U)
#define MSCAN_CANCTL1_WUPM_SHIFT                 (2U)
/*! WUPM - WakeUp Mode
 *  0b0..MSCAN wakes on any dominant level on the CAN bus.
 *  0b1..MSCAN wakes only in case of a dominant pulse on the CAN bus that has a length of Twup.
 */
#define MSCAN_CANCTL1_WUPM(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL1_WUPM_SHIFT)) & MSCAN_CANCTL1_WUPM_MASK)

#define MSCAN_CANCTL1_BORM_MASK                  (0x8U)
#define MSCAN_CANCTL1_BORM_SHIFT                 (3U)
/*! BORM - Bus-Off Recovery Mode
 *  0b0..Automatic bus-off recovery (see Bosch CAN 2.0A/B protocol specification).
 *  0b1..Bus-off recovery upon user request.
 */
#define MSCAN_CANCTL1_BORM(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL1_BORM_SHIFT)) & MSCAN_CANCTL1_BORM_MASK)

#define MSCAN_CANCTL1_LISTEN_MASK                (0x10U)
#define MSCAN_CANCTL1_LISTEN_SHIFT               (4U)
/*! LISTEN - Listen Only Mode
 *  0b0..Normal operation.
 *  0b1..Listen only mode activated.
 */
#define MSCAN_CANCTL1_LISTEN(x)                  (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL1_LISTEN_SHIFT)) & MSCAN_CANCTL1_LISTEN_MASK)

#define MSCAN_CANCTL1_LOOPB_MASK                 (0x20U)
#define MSCAN_CANCTL1_LOOPB_SHIFT                (5U)
/*! LOOPB - Loopback Self Test Mode
 *  0b0..Loopback self test disabled.
 *  0b1..Loopback self test enabled.
 */
#define MSCAN_CANCTL1_LOOPB(x)                   (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL1_LOOPB_SHIFT)) & MSCAN_CANCTL1_LOOPB_MASK)

#define MSCAN_CANCTL1_CLKSRC_MASK                (0x40U)
#define MSCAN_CANCTL1_CLKSRC_SHIFT               (6U)
/*! CLKSRC - MSCAN Clock Source
 *  0b0..MSCAN clock source is the oscillator clock.
 *  0b1..MSCAN clock source is the bus clock.
 */
#define MSCAN_CANCTL1_CLKSRC(x)                  (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL1_CLKSRC_SHIFT)) & MSCAN_CANCTL1_CLKSRC_MASK)

#define MSCAN_CANCTL1_CANE_MASK                  (0x80U)
#define MSCAN_CANCTL1_CANE_SHIFT                 (7U)
/*! CANE - MSCAN Enable
 *  0b0..MSCAN module is disabled.
 *  0b1..MSCAN module is enabled.
 */
#define MSCAN_CANCTL1_CANE(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_CANCTL1_CANE_SHIFT)) & MSCAN_CANCTL1_CANE_MASK)
/*! @} */

/*! @name CANBTR0 - MSCAN Bus Timing Register 0 */
/*! @{ */

#define MSCAN_CANBTR0_BRP_MASK                   (0x3FU)
#define MSCAN_CANBTR0_BRP_SHIFT                  (0U)
/*! BRP - Baud Rate Prescaler
 *  0b000000..1
 *  0b000001..2
 *  0b000010........
 *  0b000011........
 *  0b111110..63
 *  0b111111..64
 */
#define MSCAN_CANBTR0_BRP(x)                     (((uint8_t)(((uint8_t)(x)) << MSCAN_CANBTR0_BRP_SHIFT)) & MSCAN_CANBTR0_BRP_MASK)

#define MSCAN_CANBTR0_SJW_MASK                   (0xC0U)
#define MSCAN_CANBTR0_SJW_SHIFT                  (6U)
/*! SJW - Synchronization Jump Width
 *  0b00..1 Tq clock cycle.
 *  0b01..2 Tq clock cycles.
 *  0b10..3 Tq clock cycle.
 *  0b11..4 Tq clock cycles.
 */
#define MSCAN_CANBTR0_SJW(x)                     (((uint8_t)(((uint8_t)(x)) << MSCAN_CANBTR0_SJW_SHIFT)) & MSCAN_CANBTR0_SJW_MASK)
/*! @} */

