zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Kinetis/KE/periph3/PERI_MSCAN.h
#define MSCAN_REIDR1_REID17_REID15_MASK          (0x7U)
#define MSCAN_REIDR1_REID17_REID15_SHIFT         (0U)
/*! REID17_REID15 - Extended Format Identifier 17-15 */
#define MSCAN_REIDR1_REID17_REID15(x)            (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR1_REID17_REID15_SHIFT)) & MSCAN_REIDR1_REID17_REID15_MASK)

#define MSCAN_REIDR1_REIDE_MASK                  (0x8U)
#define MSCAN_REIDR1_REIDE_SHIFT                 (3U)
/*! REIDE - ID Extended
 *  0b0..Standard format (11 bit).
 *  0b1..Extended format (29 bit).
 */
#define MSCAN_REIDR1_REIDE(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR1_REIDE_SHIFT)) & MSCAN_REIDR1_REIDE_MASK)

#define MSCAN_REIDR1_RSRR_MASK                   (0x10U)
#define MSCAN_REIDR1_RSRR_SHIFT                  (4U)
/*! RSRR - Substitute Remote Request */
#define MSCAN_REIDR1_RSRR(x)                     (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR1_RSRR_SHIFT)) & MSCAN_REIDR1_RSRR_MASK)

#define MSCAN_REIDR1_REID20_REID18_MASK          (0xE0U)
#define MSCAN_REIDR1_REID20_REID18_SHIFT         (5U)
/*! REID20_REID18 - Extended Format Identifier 20-18 */
#define MSCAN_REIDR1_REID20_REID18(x)            (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR1_REID20_REID18_SHIFT)) & MSCAN_REIDR1_REID20_REID18_MASK)
/*! @} */

/*! @name RSIDR1 - Receive Standard Identifier Register 1 */
/*! @{ */

#define MSCAN_RSIDR1_RSIDE_MASK                  (0x8U)
#define MSCAN_RSIDR1_RSIDE_SHIFT                 (3U)
/*! RSIDE - ID Extended
 *  0b0..Standard format (11 bit).
 *  0b1..Extended format (29 bit).
 */
#define MSCAN_RSIDR1_RSIDE(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_RSIDR1_RSIDE_SHIFT)) & MSCAN_RSIDR1_RSIDE_MASK)

#define MSCAN_RSIDR1_RSRTR_MASK                  (0x10U)
#define MSCAN_RSIDR1_RSRTR_SHIFT                 (4U)
/*! RSRTR - Remote Transmission Request
 *  0b0..Data frame.
 *  0b1..Remote frame.
 */
#define MSCAN_RSIDR1_RSRTR(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_RSIDR1_RSRTR_SHIFT)) & MSCAN_RSIDR1_RSRTR_MASK)

#define MSCAN_RSIDR1_RSID2_RSID0_MASK            (0xE0U)
#define MSCAN_RSIDR1_RSID2_RSID0_SHIFT           (5U)
/*! RSID2_RSID0 - Standard Format Identifier 2-0 */
#define MSCAN_RSIDR1_RSID2_RSID0(x)              (((uint8_t)(((uint8_t)(x)) << MSCAN_RSIDR1_RSID2_RSID0_SHIFT)) & MSCAN_RSIDR1_RSID2_RSID0_MASK)
/*! @} */

/*! @name REIDR2 - Receive Extended Identifier Register 2 */
/*! @{ */

#define MSCAN_REIDR2_REID14_REID7_MASK           (0xFFU)
#define MSCAN_REIDR2_REID14_REID7_SHIFT          (0U)
/*! REID14_REID7 - Extended Format Identifier 14-7 */
#define MSCAN_REIDR2_REID14_REID7(x)             (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR2_REID14_REID7_SHIFT)) & MSCAN_REIDR2_REID14_REID7_MASK)
/*! @} */

/*! @name REIDR3 - Receive Extended Identifier Register 3 */
/*! @{ */

#define MSCAN_REIDR3_RERTR_MASK                  (0x1U)
#define MSCAN_REIDR3_RERTR_SHIFT                 (0U)
/*! RERTR - Remote Transmission Request
 *  0b0..Data frame.
 *  0b1..Remote frame.
 */
#define MSCAN_REIDR3_RERTR(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR3_RERTR_SHIFT)) & MSCAN_REIDR3_RERTR_MASK)

#define MSCAN_REIDR3_REID6_REID0_MASK            (0xFEU)
#define MSCAN_REIDR3_REID6_REID0_SHIFT           (1U)
/*! REID6_REID0 - Extended Format Identifier 6-0 */
#define MSCAN_REIDR3_REID6_REID0(x)              (((uint8_t)(((uint8_t)(x)) << MSCAN_REIDR3_REID6_REID0_SHIFT)) & MSCAN_REIDR3_REID6_REID0_MASK)
/*! @} */

/*! @name REDSR - Receive Extended Data Segment Register N */
/*! @{ */

#define MSCAN_REDSR_RDB_MASK                     (0xFFU)
#define MSCAN_REDSR_RDB_SHIFT                    (0U)
/*! RDB - Data Bits */
#define MSCAN_REDSR_RDB(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_REDSR_RDB_SHIFT)) & MSCAN_REDSR_RDB_MASK)
/*! @} */

/*! @name RDLR - Receive Data Length Register */
/*! @{ */

#define MSCAN_RDLR_RDLC_MASK                     (0xFU)
#define MSCAN_RDLR_RDLC_SHIFT                    (0U)
/*! RDLC - Data Length Code Bits
 *  0b0000..0
 *  0b0001..1
 *  0b0010..2
 *  0b0011..3
 *  0b0100..4
 *  0b0101..5
 *  0b0110..6
 *  0b0111..7
 *  0b1000..8
 */
#define MSCAN_RDLR_RDLC(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_RDLR_RDLC_SHIFT)) & MSCAN_RDLR_RDLC_MASK)
/*! @} */

/*! @name RTSRH - Receive Time Stamp Register High */
/*! @{ */

#define MSCAN_RTSRH_RTS_MASK                     (0xFFU)
#define MSCAN_RTSRH_RTS_SHIFT                    (0U)
/*! RTS - Time Stamp */
#define MSCAN_RTSRH_RTS(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_RTSRH_RTS_SHIFT)) & MSCAN_RTSRH_RTS_MASK)
/*! @} */

/*! @name RTSRL - Receive Time Stamp Register Low */
/*! @{ */

#define MSCAN_RTSRL_RTS_MASK                     (0xFFU)
#define MSCAN_RTSRL_RTS_SHIFT                    (0U)
/*! RTS - Time Stamp */
#define MSCAN_RTSRL_RTS(x)                       (((uint8_t)(((uint8_t)(x)) << MSCAN_RTSRL_RTS_SHIFT)) & MSCAN_RTSRL_RTS_MASK)
/*! @} */

/*! @name TEIDR0 - Transmit Extended Identifier Register 0 */
/*! @{ */

#define MSCAN_TEIDR0_TEID28_TEID21_MASK          (0xFFU)
#define MSCAN_TEIDR0_TEID28_TEID21_SHIFT         (0U)
/*! TEID28_TEID21 - Extended Format Identifier */
#define MSCAN_TEIDR0_TEID28_TEID21(x)            (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR0_TEID28_TEID21_SHIFT)) & MSCAN_TEIDR0_TEID28_TEID21_MASK)
/*! @} */

/*! @name TSIDR0 - Transmit Standard Identifier Register 0 */
/*! @{ */

#define MSCAN_TSIDR0_TSID10_TSID3_MASK           (0xFFU)
#define MSCAN_TSIDR0_TSID10_TSID3_SHIFT          (0U)
/*! TSID10_TSID3 - Standard Format Identifier */
#define MSCAN_TSIDR0_TSID10_TSID3(x)             (((uint8_t)(((uint8_t)(x)) << MSCAN_TSIDR0_TSID10_TSID3_SHIFT)) & MSCAN_TSIDR0_TSID10_TSID3_MASK)
/*! @} */

/*! @name TEIDR1 - Transmit Extended Identifier Register 1 */
/*! @{ */

#define MSCAN_TEIDR1_TEID17_TEID15_MASK          (0x7U)
#define MSCAN_TEIDR1_TEID17_TEID15_SHIFT         (0U)
/*! TEID17_TEID15 - Extended Format Identifier 17-15 */
#define MSCAN_TEIDR1_TEID17_TEID15(x)            (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR1_TEID17_TEID15_SHIFT)) & MSCAN_TEIDR1_TEID17_TEID15_MASK)

#define MSCAN_TEIDR1_TEIDE_MASK                  (0x8U)
#define MSCAN_TEIDR1_TEIDE_SHIFT                 (3U)
/*! TEIDE - ID Extended
 *  0b0..Standard format (11 bit).
 *  0b1..Extended format (29 bit).
 */
#define MSCAN_TEIDR1_TEIDE(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR1_TEIDE_SHIFT)) & MSCAN_TEIDR1_TEIDE_MASK)

#define MSCAN_TEIDR1_TSRR_MASK                   (0x10U)
#define MSCAN_TEIDR1_TSRR_SHIFT                  (4U)
/*! TSRR - Substitute Remote Request */
#define MSCAN_TEIDR1_TSRR(x)                     (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR1_TSRR_SHIFT)) & MSCAN_TEIDR1_TSRR_MASK)

#define MSCAN_TEIDR1_TEID20_TEID18_MASK          (0xE0U)
#define MSCAN_TEIDR1_TEID20_TEID18_SHIFT         (5U)
/*! TEID20_TEID18 - Extended Format Identifier 20-18 */
#define MSCAN_TEIDR1_TEID20_TEID18(x)            (((uint8_t)(((uint8_t)(x)) << MSCAN_TEIDR1_TEID20_TEID18_SHIFT)) & MSCAN_TEIDR1_TEID20_TEID18_MASK)
/*! @} */

/*! @name TSIDR1 - Transmit Standard Identifier Register 1 */
/*! @{ */

#define MSCAN_TSIDR1_TSIDE_MASK                  (0x8U)
#define MSCAN_TSIDR1_TSIDE_SHIFT                 (3U)
/*! TSIDE - ID Extended
 *  0b0..Standard format (11 bit).
 *  0b1..Extended format (29 bit).
 */
#define MSCAN_TSIDR1_TSIDE(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_TSIDR1_TSIDE_SHIFT)) & MSCAN_TSIDR1_TSIDE_MASK)

#define MSCAN_TSIDR1_TSRTR_MASK                  (0x10U)
#define MSCAN_TSIDR1_TSRTR_SHIFT                 (4U)
/*! TSRTR - Remote Transmission Request
 *  0b0..Data frame.
 *  0b1..Remote frame.
 */
#define MSCAN_TSIDR1_TSRTR(x)                    (((uint8_t)(((uint8_t)(x)) << MSCAN_TSIDR1_TSRTR_SHIFT)) & MSCAN_TSIDR1_TSRTR_MASK)

